# ConnectionValidationWarning Class

---
Contains information about a specific connection validation problem.
SystemObject Autodesk.Revit.DBConnectionValidationWarning
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ConnectionValidationWarning : IDisposable

    Public Class ConnectionValidationWarning
    	Implements IDisposable

    public ref class ConnectionValidationWarning : IDisposable

    type ConnectionValidationWarning =
        class
            interface IDisposable
        end
The ConnectionValidationWarning type exposes the following members.
| Name| Description
---|---|---
| ConnectionValidationWarning|  Constructor.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Reason|  Enumeration for reason of warning.
| Resolution|  Enumeration for resolution that was applied.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ConnectionValidationWarning
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetParts|  Get ElementIds of affected parts.
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace